## SQL = Jazyk databáze

SQL pomůcky:

můžete si vytvořit databázi a provádět query online
http://sqlfiddle.com/

cvičná databáze a online query :

https://www.w3schools.com/sql/trysql.asp?filename=trysql_asc

### structured query language (SQL) -  UNIVERZÁLNÍ jazyk pro práci s daty v databázích (RDBMS)

SQL funkce se dělí do 4 hlavních kategorií podle typu úkolů, které provádí. 


DDL (Data Definition Language) - language for defining data; it implements defining data structure

- vytváření tabulek a definice datové struktury pro jednotlivé hodnoty
CREATE, ALTER, DROP, TRUNCATE

DML (Data Manipulation Language) - data manipulation language; it performs data select and modification
- práce s daty, nejpoužívanější část pro nás. 
- SELECT, INSERT, UPDATE, DELETE

DCL (Data Control Language) - data access control language
- přístupová práva k datům
- GRANT, REVOKE

TCL (Transaction Control Language) - transaction control language; enables management of DML query groups.
- kontrola transakčních operací. Možnost managementu DML queries

Python can do anything...

SQL can execute queries against a database
SQL can retrieve data from a database
SQL can insert records in a database
SQL can update records in a database
SQL can delete records from a database
SQL can create new databases
SQL can create new tables in a database
SQL can create stored procedures in a database
SQL can create views in a database
SQL can set permissions on tables, procedures, and views

### Klíčová slova v SQL se píšou velkými písmeny (good practise). Ale SQL jazyk není case-sensitive

### SQL Syntax

; středník je vyžadován na konci každého SQL výroku
'' - používají se větišnou jednoduché uvozovky
VELKA PISMENA 

# Základní funkce
SELECT - extracts data from a database
UPDATE - updates data in a database
DELETE - deletes data from a database
INSERT INTO - inserts new data into a database
CREATE DATABASE - creates a new database
ALTER DATABASE - modifies a database
CREATE TABLE - creates a new table
ALTER TABLE - modifies a table
DROP TABLE - deletes a table
CREATE INDEX - creates an index (search key)
DROP INDEX - deletes an index

## Data types

- v SQL máme jiné datové typy než v Pythonu (int, str, float, list...)

- u každého sloupce se musí předem definovat jaký datový typ v něm bude

přehled: https://python.en.sdacademy.pro/coursebook/sql_databases/sql/data_types/

#### Numeric data types

bool - 0,1 = false, true

boolean - to samé jako book. Můžeme používat oboje

bigint	-2^63 (-9,223,372,036,854,775,808) to 2^63-1 (9,223,372,036,854,775,807)	(8 Bytes)

int	-2^31 (-2,147,483,648) to 2^31-1 (2,147,483,647)	(4 Bytes)

smallint	-2^15 (-32,768) to 2^15-1 (32,767)	(2 Bytes)

tinyint	0 to 255	(1 Byte)

float - small float number

double - large float number

if len(number) < 25:
    number == float
    
else: (< 53)
    number == double

#### String data types

Základní:
char(n) -	Fixed width character string	max 8,000 characters
varchar(n) - 	Variable width character string	8,000 characters
varchar(max) - 	Variable width character string	1,073,741,824 characters
text	- Variable width character string	2GB of text data	4 bytes + number of chars

Další:
binary(n)	Fixed width binary string	8,000 bytes	 
varbinary	Variable width binary string	8,000 bytes	 
varbinary(max)	Variable width binary string	2GB	 
image	Variable width binary string	2GB

#### Datetime data types

datetime	From January 1, 1753 to December 31, 9999 with an accuracy of 3.33 milliseconds	8 bytes

datetime2	From January 1, 0001 to December 31, 9999 with an accuracy of 100 nanoseconds	6-8 bytes

smalldatetime	From January 1, 1900 to June 6, 2079 with an accuracy of 1 minute	4 bytes

date	Store a date only. From January 1, 0001 to December 31, 9999	3 bytes

time	Store a time only to an accuracy of 100 nanoseconds	3-5 bytes

datetimeoffset	The same as datetime2 with the addition of a time zone offset	8-10 bytes

timestamp	Stores a unique number that gets updated every time a row gets created or modified. The timestamp value is based upon an internal clock and does not correspond to real time. Each table may have only one timestamp variable

#### NULL

NULL - pole v tabulce nemá žádnou hodnotu

Pokud je pole v tabulce nepovinné (neni required) a hodnota není zadána --> NULL je defaultní hodnota


je obdoba Pythonovského None

#### 0)  cvičení

Určete data typy pro dané hodnoty:
1) orderID - 10248
2) supplierName - New Orleans Cajun Delights
3) phone - (171) 555-2222
4) price - 21.35
5) unit - 10 boxes x 20 bags
6) date - 1996-07-04

## CRUD

Základní RDBMS funkce - create, read, update and delete operation

- C == vytvořit tabulku, vložit data
- R == zobrazovat a filtrovat si data
- U == měnit data
- D == mazat

### Create

SYNTAX

Vytvoření tabulky

CRATE TABLE 'Table_name'('column1' datatype,
                        'column2' datatype,
                        columnx datatype)

CREATE TABLE `friends` (
 `first_name` varchar(25) NOT NULL,
 `last_name` varchar(25) NOT NULL,
 `phone_num` char(12) DEFAULT NULL,
 `birthday` date DEFAULT NULL,
 `age` int(11) DEFAULT NULL
)

# DEFAULT je defaultní hodnota pokud není nic zadáno. Může být i konkrétní číslo, string, datum ...

Vkládání hodnot

INSERT INTO some_table(column(s) to populate)
VALUES(column(s) values to store);

INSERT INTO friends(first_name, last_name, phone_num, birthday, age)
VALUES(‘Jim’, ‘Dandy’, ‘476–111–1122’, ‘1977–07–19’, 42);

!Pokud vkládáme hodnoty do všech sloupců, můžeme vynechat sloupce!
INSERT INTO friends
VALUES(‘Jim’, ‘Dandy’, ‘476–111–1122’, ‘1977–07–19’, 42);

Pokud by bylo hodnot méně tak by vzniknul error:
ERROR 1136 (21S01): Column count doesn’t match value count at row 1


!Pokud chceme jen hodnoty pro určité sloupce, musíme je specifikovat!
INSERT INTO friends(first_name, last_name)
VALUES(‘John’, ‘Snow’);

Vkládání více řádků:

INSERT INTO friends(first_name, last_name, phone_num, birthday, age)
VALUES(‘Charlie’,’Charles’,’888–767–2323',’1971–08–22',48),
      (‘Humpty’,’Dumpty’,’118–257–7344',’1971–11–22',48),
      (‘Roger’,’Dodger’,’234–767–3983',’1975–08–22',44);

#### 1) Cvičení

Vytvořte tabulku "countries" / "zeme" která bude mít 5 sloupců:

country - název země 
region - kontinent
populace - počet obyvatel
rozloha - rozhloha (celé km2)
vzdělanost - vzdělanost (% , desetiny procenta)

a vložte do ní 5 zemí (nechám na vás)

### Read

#### SELECT a SELECT DISTINCT

Syntax

SELECT * FROM table_name;     # * == všechny sloupce


SELECT column1, column2, ... sloupce i jméno tabulky bez uvozovek
FROM table_name;


SELECT DISTINCT Country FROM Customers; # pouze unikátní hodnoty

#### WHERE

Syntax


SELECT column1, column2, ...
FROM table_name
WHERE condition;

SELECT * FROM Customers
WHERE Country='Mexico';   # musíme použít jednoduché uvozovky u textových hodnot
                          * některé RBDMS zvládají i dvojité uvozovky

SELECT * FROM Customers
WHERE CustomerID=1;       # int hodnoty bez uvozovek

Operators:
= rovno
> větší než
< menší než
<=
>=      #rovná se až za znaménkem nerovnosti
<> není rovno  (záleží na verzi SQL)
!= není rovno (záleží na verzi SQL)
BETWEEN - mezi dvěma hodnotami (range)
LIKE - hledá podle zadaného patternu
IN - v - hledá v daných možnostěch
IS NULL - hodnota pole je NULL
IS NOT NULL - hodnota pole není NULL

#### 2) cvičení
Budeme používat tabulku W3 schools Customers - https://www.w3schools.com/sql/trysql.asp?filename=trysql_asc

Napište queries na vybrání z Customers:
    1) Seznam unikátních zemí 
    2) Seznam všech záznamů kde země nejsou Germany a Mexico
    3) Zákazníky (ContactName a Address) s IDs od 10 do 30
    4) Všechny zákazníky jejichž křestní jméno je Maria
    5) všechny údaje o zákaznících z Berlína, Londýna, Paříže a Madridu

#### Spojování podmínek AND, OR, NOT

AND - all conditions are TRUE
OR - any condition is TRUE
NOT - if the condition is FALSE (NOT TRUE)

Syntax
SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND condition2 AND condition3 ...;

SELECT column1, column2, ...
FROM table_name
WHERE condition1 OR condition2 OR condition3 ...;

SELECT column1, column2, ...
FROM table_name
WHERE NOT condition;

#### ORDER BY

Řazení výsledků

Syntax

SELECT column1, column2, ...
FROM table_name
ORDER BY column1 ... ASC|DESC; 

Můžeme řadit i podle více sloupců

SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;

#### 3) cvičení

Napiště query pro Customers (zobrazit všechny sloupce):
a) kteří jsou z Anglie nebo Francouzských měst Nantes a Lille
b)kteří jsou z Mexika a jejich ID je v rozmezí 1-20  nebo zákazníky s ID nad 80 
c) seřaďte zákazníky podle zemí (A-Z) a měst (A-Z)
d) vyberte zákazníky z Německa a Francie kteří nejsou z hlavních měst a seřaťe je podle jména (contact name)

# Doplnit po cvičení -> spojování více podmínek --> závorky
# Doplnit po cvičení -> řazení podle více sloupců

SELECT * FROM Customers
ORDER BY Country ASC, CustomerName DESC;

#### SELECT TOP // LIMIT

# Vybírá jen určitý počet výsledků. Vhodné na velké data sety
* v MySQL se používá LIMIT místo SELECT TOP
* v Postgres SELECT TOP
Syntax

SQL TryitEditor používá limit

SELECT column_name(s)
FROM table_name
WHERE condition
LIMIT number;

SELECT TOP number|percent column_name(s)
FROM table_name
WHERE condition;

#### AS

Aliases - slouží k dočasnému přejmenování tabulky nebo jména sloupců
Používají se pro zpřehlednění výstupu

Alias končí po zániku query

klíčové slovo AS

Syntax

SELECT column_name AS alias_name
FROM table_name;

SELECT column_name(s)
FROM table_name AS alias_name;

SELECT CustomerID AS ID, CustomerName AS Customer
FROM Customers;

#### MIN () MAX ()

Vrací nejmenší nebo největší hodnotu. Musí být v závorce

Syntax

SELECT MIN(column_name)
FROM table_name
WHERE condition;

SELECT MAX(column_name)
FROM table_name
WHERE condition;

* vysvětlit as
SELECT MIN(Price) AS SmallestPrice
FROM Products;

*SELECT MAX(Price) AS LargestPrice
FROM Products;

#### COUNT() AVG() SUM()

COUNT -> počet výskytů
AVG -> průměr
SUM -> suma

SELECT COUNT/AVG/SUM(column_name)
FROM table_name
WHERE condition;

SELECT COUNT(ProductID)
FROM Products;

SELECT AVG(Price)
FROM Products;

SELECT * FROM Customers
WHERE Country='Germany'
LIMIT 3;

#### 4) cvičení - Použijte tabulku Products z databáze

1) Najděte nejlevnější položku
2) Najděte top 10 nejdražsích položek
3) vypočítejte průměrnou cenu položek
4) kolik je položek s CategoryID 4
5) kolik je unikátních jmen produktů

#### LIKE

operátor LIKE se používá za klíčovým slovem WHERE
LIKE vyhledává výrazy podle určitého patternu (like je v angličtině jako)

LIKE používá WILDCARDS (setkali jsme se s nimi už při regex v pythonu)
% - znamená nula, jeden nebo mnoho znaků
_ - jeden znak

Syntax

SELECT column1, column2, ...
FROM table_name
WHERE columnN LIKE pattern;

dá se také používat s AND / OR

příklady:
WHERE CustomerName LIKE 'a%'	- všechno začínající na "a"
WHERE CustomerName LIKE '%a'	- ?
WHERE CustomerName LIKE '%sla%'	- svatoslav, jaroslav, dobroslav, miroslav...
WHERE CustomerName LIKE '_e%'	- "e" na druhé pozici (např Petr)
WHERE CustomerName LIKE 'a_%'	- začíná na "a" a je minimálně 2 znaky dlouhá
WHERE CustomerName LIKE 'a__%'	- začíná na "a" a je minimálně 3 znaky dlouhá
WHERE ContactName LIKE 's%a'    - začíná na s a končí na a (sda, sranda)

SELECT * FROM Customers
WHERE CustomerName LIKE 'a%';


POUŽÍTÍ s NOT 
SELECT * FROM Customers
WHERE CustomerName NOT LIKE 'a%';

#### OSTATNÍ WILDCARDS

[] - jakýkoliv znak v závorce   h[oa]t finds hot and hat
[^] - jakýkoliv znak co není v závorce   h[^oa]t finds hit, but not hot and hat
[a-z] - jakýkoliv znak v range [a-l]ostel - hostel, kostel, ... ne postel

dají se kombinovat i s % a _
SELECT * FROM Customers
WHERE City LIKE '[bsp]%';

SELECT * FROM Customers
WHERE City LIKE '[a-c]%';

### UPDATE

Modifikování existujících hodnot v tabulce

Syntax

UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;

Pozor!
UPDATE Customers
SET ContactName='Petr'; - Nastaví všechny jména na Petr

### DELETE

Mazání dat z tabulky

Syntax

DELETE FROM table_name WHERE condition;

DELETE FROM Customers WHERE CustomerName='Alfreds Futterkiste'; # Vymaže to celý řádek


Ukol na konec -> vymažte všechny data z Customers
DELETE FROM Customers;

### Vlastní databáze
- http://sqlfiddle.com/
- geonames_sql_fiddle.txt
- nebo csv

#### 5) Cvičení

Vypracujte následující operace v tabulce countries (země od A až po Fiji) = napiště query na:
1) zobrazení zemí evropy a jejich hlavních měst
2) zobrazit 10 největších států podle rozlohy a seřadit je podle počtu obyvatel
3) zobrazit všechny názvy měn
4) kolika currency name se platí
5) v jakých zemích se platí dolarem. Seradit podle populace
6) Jaká je průměrná velikost států v severní a jižní americe (continent SA, NA)
7) Kolik mají průměrný počet obyvatel státy afriky
8) zobrazte státy podle abeceby které mají pouze dvouciferný ISONumerický kod
9) zobrate státy jejichž první dvě písmena ISO3 kodu jsou stejné jako SO kod (ten dvou písmenný))
9 a 3/4) státy s doménou na "e"
10) zobrazte všechny řádky - měny které končí na "D" a seradte je podle velikosti země
11) Nahradte všechny jméná států evropy na `Evropska Unie`
12) vymažte všechny státy Asie a spočítejte kolik zůstalo položek
13) vymažte všechno :)

Jestli zůstal čas -> udělat cvíčení 1-13 v pandách :)

## Operace mezi více tabulkami

### READ

#### IN

Dovoluje specifikovat více hodnot po WHERE
Je to náhrada za více OR
SELECT ::::

WHERE city = 'Paris' OR city = 'Berlin' OR city = 'Prague'
x
WHERE city in ('Paris', 'Berlin', 'Prague')

Syntax

SELECT column_name(s)
FROM table_name
WHERE column_name IN (value1, value2, ...);


Next level:

SELECT column_name(s)
FROM table_name
WHERE column_name IN (SELECT STATEMENT);

SELECT * FROM Customers
WHERE Country IN (SELECT Country FROM Suppliers);

#### BETWEEN

Operátor vybírá hodnoty z určité range (číselné, textové, date)
počáteční a konečné hodnoty jsou zahrnuté (= inclusive)

Syntax

SELECT column_name(s)
FROM table_name
WHERE column_name BETWEEN value1 AND value2;

SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20;

SELECT * FROM Products
WHERE Price NOT BETWEEN 10 AND 20;


Kombinace s IN

SELECT * FROM Products
WHERE Price BETWEEN 10 AND 20
AND CategoryID NOT IN (1,2,3);

SELECT * FROM Products
WHERE ProductName BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
ORDER BY ProductName;

SELECT * FROM Products
WHERE ProductName NOT BETWEEN 'Carnarvon Tigers' AND 'Mozzarella di Giovanni'
ORDER BY ProductName;

SELECT * FROM Orders
WHERE OrderDate BETWEEN '1996-07-01' AND '1996-07-31';

#### AS (podruhé)

Spojování více sloupců do jednoho sloupce (nejede v SQL online editoru)

SELECT CustomerName, Address + ', ' + PostalCode + ' ' + City + ', ' + Country AS Address
FROM Customers;


Přejmenování tabulek pro zkrácení zápisu query

SELECT o.OrderID, o.OrderDate, c.CustomerName
FROM Customers AS c, Orders AS o
WHERE c.CustomerName='Around the Horn' AND c.CustomerID=o.CustomerID;

#### JOIN

slouží ke kombinování řádků ze dvou a více tabulek podle zadaných sloupců

ke spojování nám slouží relace (protože jsme v relačních databázích :) - IDs, případně stejné hodnoty -> jména zemí, měst, atd.

Syntax

SELECT Orders.OrderID, Customers.CustomerName, Orders.OrderDate
FROM Orders
INNER JOIN Customers ON Orders.CustomerID=Customers.CustomerID;

Vypíše sloupce OrderID a OrderDate z Orders a CustomerName z Customers  -> ukázat







https://www.w3schools.com/sql/sql_join.asp - ukázat - grafika joinu

TYPY JOINs -> obdoba operací na setu v pythonu

(INNER) JOIN: == Průnik -> Vrátí hodnoty společné pro obě tabulky 

LEFT (OUTER) JOIN: Vrací všechny záznamy z levé tabulky (té co je napsaná dříve) + záznamy z pravé tabulky které splňují podmínky

RIGHT (OUTER) JOIN: Vrací všechny záznamy z pravé tabulky+ záznamy z levé tabulky které splňují podmínky

FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

#### INNER JOIN

Syntax

SELECT column_name(s)
FROM table1
INNER JOIN table2
ON table1.column_name = table2.column_name;


SELECT Orders.OrderID, Customers.CustomerName
FROM Orders
INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID;


# Spojení 3 tabulek:
SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
FROM ((Orders
INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);

#### LEFT JOIN

In [ ]:
SELECT column_name(s)
FROM table1
LEFT JOIN table2
ON table1.column_name = table2.column_name;

SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
ORDER BY Customers.CustomerName;

#### RIGHT JOIN

SELECT column_name(s)
FROM table1
RIGHT JOIN table2
ON table1.column_name = table2.column_name;

SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
FROM Orders
RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
ORDER BY Orders.OrderID;

#### FULL JOIN

In [ ]:
SELECT column_name(s)
FROM table1
FULL OUTER JOIN table2
ON table1.column_name = table2.column_name
WHERE condition;

SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
ORDER BY Customers.CustomerName;

#### UNION

UNION kombinuje výsledky dvou a více SELECT výroků

Pravidla

Každý SELECT musí mít stejný počet sloupců na výstupu
Sloupce musí mít podobné Data types


Syntax

SELECT column_name(s) FROM table1
UNION
SELECT column_name(s) FROM table2;

SELECT City FROM Customers
UNION
SELECT City FROM Suppliers
ORDER BY City;

# 94 results

Základní UNION nepovoluje duplikáty. Abychom  duplikáty zobrazili, můžeme použít UNION ALL

SELECT column_name(s) FROM table1
UNION ALL
SELECT column_name(s) FROM table2;

SELECT City FROM Customers
UNION ALL
SELECT City FROM Suppliers
ORDER BY City;

# 119 results

UNION WHERE - s podmínkou

SELECT City, Country FROM Customers
WHERE Country='Germany'
UNION
SELECT City, Country FROM Suppliers
WHERE Country='Germany'
ORDER BY City;


UNION AS

SELECT 'Customer' AS Type, ContactName, City, Country # přidáváme a přejmenováváme  sloupec Customer jako Type + ostatní sloupce
FROM Customers
UNION
SELECT 'Supplier', ContactName, City, Country
FROM Suppliers;

#### GROUP BY

In [ ]:
Aggreguje výsledky podle zadaných parametrů

Používá se často s aggregačními funkcemi COUNT(), MAX(), MIN(), SUM(), AVG()

Kombinuje se i s ORDER BY

Syntax

SELECT column_name(s)
FROM table_name
WHERE condition
GROUP BY column_name(s)
ORDER BY column_name(s);

SELECT COUNT(CustomerID), Country
FROM Customers
GROUP BY Country;


Next level - s JOIN

SELECT Shippers.ShipperName, COUNT(Orders.OrderID) AS NumberOfOrders FROM Orders
LEFT JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID
GROUP BY ShipperName;